# 3. Index
to access data

In [44]:
import pandas as pd

data = {
    'name' : ['Park', 'Lee', 'Kim', 'Rishi', 'Chen'],
    'school' : ['GATech','GATech','GATech','GATech','GATech'],
    'language' : ['Python', 'Java', 'C', 'Ruby', 'TypeScript']
}
df = pd.DataFrame(data, index = ['1', '2', '3', '4', '5'])
df

    name  school    language
1   Park  GATech      Python
2    Lee  GATech        Java
3    Kim  GATech           C
4  Rishi  GATech        Ruby
5   Chen  GATech  TypeScript

In [45]:
df.index

Index(['1', '2', '3', '4', '5'], dtype='object')

## Index name set

In [46]:
df.index.name = 'number'
df

         name  school    language
number
1        Park  GATech      Python
2         Lee  GATech        Java
3         Kim  GATech           C
4       Rishi  GATech        Ruby
5        Chen  GATech  TypeScript

## Index reset

In [47]:
df.reset_index()

  number   name  school    language
0      1   Park  GATech      Python
1      2    Lee  GATech        Java
2      3    Kim  GATech           C
3      4  Rishi  GATech        Ruby
4      5   Chen  GATech  TypeScript

In [48]:
df.reset_index(drop = True)

    name  school    language
0   Park  GATech      Python
1    Lee  GATech        Java
2    Kim  GATech           C
3  Rishi  GATech        Ruby
4   Chen  GATech  TypeScript

In [50]:
df.reset_index(drop = True, inplace = True) # affects real data

In [51]:
df

    name  school    language
0   Park  GATech      Python
1    Lee  GATech        Java
2    Kim  GATech           C
3  Rishi  GATech        Ruby
4   Chen  GATech  TypeScript

## Index Set
set index by column

In [52]:
df.set_index('name')

       school    language
name
Park   GATech      Python
Lee    GATech        Java
Kim    GATech           C
Rishi  GATech        Ruby
Chen   GATech  TypeScript

In [54]:
df.set_index('name', inplace = True) # affects real data
df

       school    language
name
Park   GATech      Python
Lee    GATech        Java
Kim    GATech           C
Rishi  GATech        Ruby
Chen   GATech  TypeScript

## Index Sort

In [56]:
df.sort_index()

       school    language
name
Chen   GATech  TypeScript
Kim    GATech           C
Lee    GATech        Java
Park   GATech      Python
Rishi  GATech        Ruby

In [57]:
df.sort_index(ascending = False)

       school    language
name
Rishi  GATech        Ruby
Park   GATech      Python
Lee    GATech        Java
Kim    GATech           C
Chen   GATech  TypeScript